ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5xGattServer.cpp
            if (reply.params.write.gatt_status != BLE_GATT_STATUS_SUCCESS)
            {
                reply.params.write.update = 0;
            }
            
            sd_ble_gatts_rw_authorize_reply(gattsEventP->conn_handle, &reply);

            /*
             * If write-authorization is enabled for a characteristic,
             * AUTHORIZATION_REQ event (if replied with true) is *not*
             * followed by another DATA_WRITTEN event; so we still need
             * to invoke handleDataWritten(), much the same as we would
             * have done if write-authorization had not been enabled.
             */
            if (reply.params.write.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                GattWriteCallbackParams cbParams = {
                    .connHandle = gattsEventP->conn_handle,
                    .handle     = handle_value,
                    .writeOp    = static_cast<GattWriteCallbackParams::WriteOp_t>(gattsEventP->params.authorize_request.request.write.op),
                    .offset     = gattsEventP->params.authorize_request.request.write.offset,
                    .len        = gattsEventP->params.authorize_request.request.write.len,
                    .data       = gattsEventP->params.authorize_request.request.write.data,
                };
                handleDataWrittenEvent(&cbParams);
            }
            break;
        }
        case GattServerEvents::GATT_EVENT_READ_AUTHORIZATION_REQ: {
            GattReadAuthCallbackParams cbParams = {
                .connHandle         = gattsEventP->conn_handle,
                .handle             = handle_value,
                .offset             = gattsEventP->params.authorize_request.request.read.offset,
                .len                = 0,
                .data               = NULL,
                .authorizationReply = AUTH_CALLBACK_REPLY_SUCCESS /* the callback handler must leave this member
                                                                   * set to AUTH_CALLBACK_REPLY_SUCCESS if the client
                                                                   * request is to proceed. */
            };

            ble_gatts_rw_authorize_reply_params_t reply = {
                .type = BLE_GATTS_AUTHORIZE_TYPE_READ,
                .params = {
                    .read = {
                        .gatt_status = p_characteristics[characteristicIndex]->authorizeRead(&cbParams)
                    }
                }
            };

            if (cbParams.authorizationReply == BLE_GATT_STATUS_SUCCESS) {
                if (cbParams.data != NULL) {
                    reply.params.read.update = 1;
                    reply.params.read.offset = cbParams.offset;
                    reply.params.read.len    = cbParams.len;
                    reply.params.read.p_data = cbParams.data;
                }
            }

            sd_ble_gatts_rw_authorize_reply(gattsEventP->conn_handle, &reply);
            break;
        }

        default:
            handleEvent(eventType, handle_value);
            break;
    }
}

uint16_t nRF5xGattServer::getBiggestCharacteristicSize() const {
    uint16_t result = 0;
    for (size_t i = 0; i < characteristicCount; ++i) {
        uint16_t current_size = p_characteristics[i]->getValueAttribute().getMaxLength();
        if (current_size > result) {
            result = current_size;
        }
    }
    return result;
}

nRF5xGattServer::long_write_request_t* nRF5xGattServer::allocateLongWriteRequest(uint16_t connection_handle) {
    for (size_t i = 0; i < TOTAL_CONCURENT_LONG_WRITE_REQUEST; ++i) {
        long_write_request_t& req = long_write_requests[i];
        if (req.data == NULL) {
            uint16_t block_size = getBiggestCharacteristicSize();
            req.data = static_cast<uint8_t*>(malloc(block_size));
            req.offset = 0;
            req.length = 0;
            req.conn_handle = connection_handle;
            return &req;
        }
    }
    // if nothing has been found then return null
    return NULL;
}

bool nRF5xGattServer::releaseLongWriteRequest(uint16_t connection_handle) {
    long_write_request_t* req = findLongWriteRequest(connection_handle);
    if (!req) {
        return false;
    }

    free(req->data);
    req->data = NULL;

    // the other fields are not relevant, return now
    return true;
}

nRF5xGattServer::long_write_request_t* nRF5xGattServer::findLongWriteRequest(uint16_t connection_handle) {
    for (size_t i = 0; i < TOTAL_CONCURENT_LONG_WRITE_REQUEST; ++i) {
        long_write_request_t& req = long_write_requests[i];
        if (req.data != NULL && req.conn_handle == connection_handle) {
            return &req;
        }
    }
    // if nothing has been found then return null
    return NULL;
}

void nRF5xGattServer::releaseAllWriteRequests() {
    for (size_t i = 0; i < TOTAL_CONCURENT_LONG_WRITE_REQUEST; ++i) {
        long_write_request_t& req = long_write_requests[i];
        if (req.data != NULL) {
            free(req.data);
            req.data = NULL;
        }
    }
}